# 任务：1、2、3、4、5，这五个数能组成多少个互不相同且无重复数字的三位数？各是多少？

# 方法一

for x in range(1, 6):
    for y in range(1, 6):
        for z in range(1, 6):
            if (x != y) and (y != z) and (x != z):
                num = x * 100 + y * 10 + z
                print(num)

# 方法二

L = list(x * 100 + y * 10 + z for x in range(1, 6) for y in range(1, 6) for z in range(1, 6) if (x != y) and (y != z) and (x != z))
print(len(L))
print(L)
        
# 输出结果

60
[123, 124, 125, 132, 134, 135, 142, 143, 145, 152, 153, 154, 213, 214, 215, 231, 234, 235, 241, 243, 245, 251, 253, 254, 312, 314, 315, 321, 324, 325, 341, 342, 345, 351, 352, 354, 412, 413, 415, 421, 423, 425, 431, 432, 435, 451, 452, 453, 512, 513, 514, 521, 523, 524, 531, 532, 534, 541, 542, 543]
