# 任务：企业发放的奖金根据利润提成。

# 利润(I)低于或等于10万元时，可提成10%；
# 10万到20万之间时，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时，高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，
# 高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？

i = int(input('当月净利润：'))
arr = [1000000, 600000, 400000, 200000, 100000, 0]
rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]
r = 0
for idx in range(0, 6):
    if i > arr[idx]:
        r += (i - arr[idx]) * rat[idx]
        print((i - arr[idx]) * rat[idx])
        i = arr[idx]
print(r)

# 任务：计算学生成绩评级。

# 成绩大于等于90分时，该学生成绩评级为 A ；
# 成绩大于等于80分时，该学生成绩评级为 B ；
# 成绩大于等于60分时，该学生成绩评级为 C ；
# 成绩小于60分时，该学生成绩评级为 D ；

i = int(input('请输入成绩：'))
g = [90, 80, 60, 0]
c = ['A', 'B', 'C', 'D']
for idx in range(len(g)):
    if i >= g[idx]:
        print('该学生的成绩评级是：%s' % c[idx])
        break
